uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1.h
/***************************************************************************//**
* \file     ADC_1.h
* \version  1.20
*
* \brief
* Provides the source code to the API for the ADC_1 Component.
*
********************************************************************************
* \copyright
* (c) 2015-2016, Cypress Semiconductor Corporation. All rights reserved.
* This software, including source code, documentation and related
* materials ("Software"), is owned by Cypress Semiconductor
* Corporation ("Cypress") and is protected by and subject to worldwide
* patent protection (United States and foreign), United States copyright
* laws and international treaty provisions. Therefore, you may use this
* Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, nonexclusive,
* non-transferable license to copy, modify, and compile the
* Software source code solely for use in connection with Cypress's
* integrated circuit products. Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO
* WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING,
* BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
* PARTICULAR PURPOSE. Cypress reserves the right to make
* changes to the Software without notice. Cypress does not assume any
* liability arising out of the application or use of the Software or any
* product or circuit described in the Software. Cypress does not
* authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#if !defined(CY_ADC_1_H)
    #define CY_ADC_1_H

/*******************************************************************************
                                  Project Files
*******************************************************************************/
#include "cytypes.h"
#include "cyfitter.h"
#include "CyLib.h"
#include "ADC_1_IRQ.h"

#define ADC_1_VREF_ROUTED                  ((0) == 1u)
#if (ADC_1_VREF_ROUTED)
#include "ADC_1_vrefAMux.h"
#endif

#define ADC_1_CLOCK_INTERNAL               ((1) == 1u)
#if (ADC_1_CLOCK_INTERNAL)
#include "ADC_1_intSarClock.h"
#endif /* ADC_1_CLOCK_INTERNAL */

#define ADC_1_CFG0_FILTER_PRESENT          (1uL)
#define ADC_1_CFG1_FILTER_PRESENT          (0uL)
#define ADC_1_CFG2_FILTER_PRESENT          (0uL)
#define ADC_1_CFG3_FILTER_PRESENT          (0uL)

#define ADC_1_ANY_CONFIG_USES_FILTER       ( ADC_1_CFG0_FILTER_PRESENT \
                                                      | ADC_1_CFG1_FILTER_PRESENT \
                                                      | ADC_1_CFG2_FILTER_PRESENT \
                                                      | ADC_1_CFG3_FILTER_PRESENT \
                                                      )


#if(ADC_1_ANY_CONFIG_USES_FILTER != 0u)
    #include "ADC_1_FILTER.h"
    #include "ADC_1_UABH_A.h"
    #include "ADC_1_UABH_B.h"
    #include "ADC_1_intUabClock.h"
    #include "ADC_1_filterVinMux.h"
    #include "ADC_1_FILTERAGND2SAR_BUFFER.h"
#endif


/**
* \addtogroup group_structures
*
*/
/** Low power Mode API Support */
typedef struct
{
    /** Preserves state of block prior to sleep. */
    uint8   enableState;
}   ADC_1_BACKUP_STRUCT;

typedef struct
{
    uint32 channelBase;    /* Start of channels for the configuration */
    uint32 numChannels;    /* Number of channels in the configuration */
    uint32 ctrl;           /* Contains the initial settings for the CRTL register except for the BOOSTPUMP_EN and
                              ENABLED bits which are set in the ADC_1_Init() ADC_1_Enable()
                              respectively */
    uint32 sampleCtrl;     /* Initial SAMPLE_CTRL register value */
    uint32 sampleTime01;   /* Initial SAMPLE_TIME01 register value */
    uint32 sampleTime23;   /* Initial SAMPLE_TIME23 register value */
    uint32 rangeThres;     /* Initial RANGE_THRES register value */
    uint32 rangeCond;      /* Initial RANGE_COND register value */
    uint32 chanEn;         /* Initial CHAN_EN register value */
    uint32 rangeIntMask;   /* Initial RANGE_INTR_MASK register value */
    uint32 satIntMask;     /* Stores the initial SAT_INTR_MASK register value */
    int32 vrefMvValue;      /* Calculated value of VREF in millivolts. Used in
                               ADC_1_CountsTo*Volts() functions */
    uint32 miscConfig;      /* Miscellaneous configuration bits broken down as follows:
                                [0] - Freerunning: Set if the sample mode is freerunning
                                [1] - Filter Present: Set if the configuration uses a UAB filter
                                [2] - Mux Switch 0: Set when VSSA is used for the neg input to any single-ended channel
                            */

#if (ADC_1_CLOCK_INTERNAL)
    uint16 clkDivider;      /* Clock divider */
#endif /* ADC_1_CLOCK_INTERNAL */

#if(ADC_1_ANY_CONFIG_USES_FILTER != 0u)
    uint16 filterClkDivider;
#endif /* ADC_1_ANY_CONFIG_USES_FILTER   != 0u */
} ADC_1_CONFIG_STRUCT;
/** @} structures */

/*******************************************************************************
*           API Constants
*******************************************************************************/
/**
* \addtogroup group_constants
* {
*/
/** \addtogroup endConversion EOS status
* \brief Parameter constants for the ADC_1_IsEndConversion()
*  function.
*  @{
*/

/** Immediately returns conversion result */
#define ADC_1_RETURN_STATUS              (1u)
/** Doesn't return until ADC conversion is done */
#define ADC_1_WAIT_FOR_RESULT            (2u)

#define ADC_1_CONTINUOUS                 (1u)
#define ADC_1_SINGLE_SHOT                (2u)
typedef enum
{
    VNEGSOURCE_VSSA_K = 0, /**< Vssa */
    VNEGSOURCE_EXTERNAL = 2, /**< External */
    VNEGSOURCE_VREFSHORT = 7 /**< Vref */
} ADC_1_vneg_source_enum;


/* Constants for Sleep mode states */
#define ADC_1_ENABLED                    (0x01u)
#define ADC_1_STARTED                    (0x02u)
#define ADC_1_BOOSTPUMP_ENABLED          (0x04u)
#define ADC_1_SLEEP_DFT_DCEN             (0x08u)
#define ADC_1_SLEEP_DFT_DLY_INC          (0x10u)
/** @} group_constants */

