uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1.h
/*******************************************************************************
* Function Prototypes
*******************************************************************************/
void ADC_1_SelectConfig(uint32 config, uint32 restart);
void ADC_1_InitConfig(const ADC_1_CONFIG_STRUCT *config);
void ADC_1_Init(void);
void ADC_1_Enable(void);

CY_ISR_PROTO(ADC_1_Interrupt);

/**
* \addtogroup group_general
* @{
*/
void ADC_1_Start(void);
void ADC_1_StartEx(cyisraddress address);
void ADC_1_Stop(void);
void ADC_1_StartConvert(void);
void ADC_1_StopConvert(void);
void ADC_1_SetConvertMode(uint32 mode);
void ADC_1_SetEosMask(uint32 mask);
uint32 ADC_1_IsEndConversion(uint32 retMode);
int16 ADC_1_GetResult16(uint32 chan);
int32 ADC_1_GetResult32(uint32 chan);
void ADC_1_SetLowLimit(uint32 lowLimit);
void ADC_1_SetHighLimit(uint32 highLimit);
void ADC_1_SetLimitMask(uint32 limitMask);
void ADC_1_SetSatMask(uint32 satMask);
void ADC_1_SetOffset(uint32 chan, int16 offset);
void ADC_1_SetGain(uint32 chan, int32 adcGain);
int16 ADC_1_RawCounts2Counts(uint32 chan, int16 adcCounts);
float32 ADC_1_CountsTo_Volts(uint32 chan, int16 adcCounts);
int16 ADC_1_CountsTo_mVolts(uint32 chan, int16 adcCounts);
int32 ADC_1_CountsTo_uVolts(uint32 chan, int16 adcCounts);


/** @} general */

void ADC_1_SetChanMask(uint32 enableMask);
void ADC_1_SaveConfig(void);
void ADC_1_RestoreConfig(void);

/**
* \addtogroup group_power
* @{
*/
void ADC_1_Sleep(void);
void ADC_1_Wakeup(void);
/** @} power */
CY_ISR_PROTO( ADC_1_ISR );

/*******************************************************************************
*       Type defines
*******************************************************************************/


/*******************************************************************************
                                  Parameters
The parameters that are set in the customizer are redefined as constants here.
*******************************************************************************/

/*  Sample Mode setting constants */
#define ADC_1_TOTAL_CONFIGS                (1ul)
#define ADC_1_IRQ_REMOVE                   (0u)

/* ************************************************************************** */
/* Begin configuration 0 customizer defines                                   */
/* ************************************************************************** */

#define ADC_1_CFG0_SAMPLE_RATE             (100000)
#define ADC_1_CFG0_CHANNEL_BASE            (0u)
#define ADC_1_CFG0_CHANNEL_COUNT           (1u)
#define ADC_1_CFG0_VREF_SEL_MASK           (0xf0u)
#define ADC_1_CFG0_NOMINAL_CLOCK_FREQ      (12000000u)
#define ADC_1_CFG0_CHANNEL_EN              (0x1u)
/* Sample Control Register */
#define ADC_1_CFG0_SUB_RESOLUTION          (0u)
#define ADC_1_CFG0_SINGLE_ENDED_FORMAT     (0uL)
#define ADC_1_CFG0_DIFFERENTIAL_FORMAT     (1uL)
#define ADC_1_CFG0_SAMPLES_AVERAGED        (0uL)
#define ADC_1_CFG0_RANGE_INTR_MASK         (0x0u)
#define ADC_1_CFG0_SATURATE_INTR_MASK      (0x0u)
#define ADC_1_CFG0_VNEG_INPUT_SEL          (7)
#define ADC_1_CFG0_SINGLE_PRESENT          (0)
#define ADC_1_CFG0_VREF_MV_VALUE           (3300)
#define ADC_1_CFG0_APERTURE_TIME0          (106uL)
#define ADC_1_CFG0_APERTURE_TIME1          (2uL)
#define ADC_1_CFG0_APERTURE_TIME2          (2uL)
#define ADC_1_CFG0_APERTURE_TIME3          (2uL)
#define ADC_1_CFG0_FREERUNNING             (1u)
#define ADC_1_CFG0_AVGERAGING_MODE         (1uL)
#define ADC_1_CFG0_LOW_LIMIT               (512u)
#define ADC_1_CFG0_HIGH_LIMIT              (3584u)
#define ADC_1_CFG0_RANGE_COND              (0uL)
#define ADC_1_CFG0_USE_SOC                 (0uL)
/* Clock parameters*/
#if (ADC_1_CLOCK_INTERNAL)
    #define ADC_1_CFG0_CLOCKDIVIDER        (((CYDEV_BCLK__HFCLK__HZ) / (ADC_1_CFG0_NOMINAL_CLOCK_FREQ)) - 1u)
#endif /* (ADC_1_CLOCK_INTERNAL) */
/* Filter Parameters */
#if(ADC_1_CFG0_FILTER_PRESENT == 1uL)
    /* Timing settings */
    /* Clock divider register uses 0 for a divider of 1, 1 for a divider of 2, and so on. */
    #define ADC_1_CFG0_FILTERCLOCKDIVIDER  (8u - 1u)
    #define ADC_1_CFG0_FILTERSTARTDELAY    (13u)
#endif /* (ADC_1_CFG0_FILTER_PRESENT == 1uL) */

/* ************************************************************************** */
/* End configuration 0 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 1 customizer defines                                   */
/* ************************************************************************** */

#if(ADC_1_TOTAL_CONFIGS > 1)
    #define ADC_1_CFG1_SAMPLE_RATE             ()
    #define ADC_1_CFG1_CHANNEL_BASE            (u)
    #define ADC_1_CFG1_CHANNEL_COUNT           (u)
    #define ADC_1_CFG1_VREF_SEL_MASK           (u)
    #define ADC_1_CFG1_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_1_CFG1_CHANNEL_EN              (u)
    /* Sample Control Register */
    #define ADC_1_CFG1_SUB_RESOLUTION          (u)
    #define ADC_1_CFG1_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_1_CFG1_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_1_CFG1_SAMPLES_AVERAGED        (uL)
    #define ADC_1_CFG1_RANGE_INTR_MASK         (u)
    #define ADC_1_CFG1_SATURATE_INTR_MASK      (u)
    #define ADC_1_CFG1_VNEG_INPUT_SEL          ()
    #define ADC_1_CFG1_SINGLE_PRESENT          ()
    #define ADC_1_CFG1_VREF_MV_VALUE           ()
    #define ADC_1_CFG1_APERTURE_TIME0          (uL)
    #define ADC_1_CFG1_APERTURE_TIME1          (uL)
    #define ADC_1_CFG1_APERTURE_TIME2          (uL)
    #define ADC_1_CFG1_APERTURE_TIME3          (uL)
    #define ADC_1_CFG1_FREERUNNING             (u)
    #define ADC_1_CFG1_AVGERAGING_MODE         (uL)
    #define ADC_1_CFG1_LOW_LIMIT               (u)
    #define ADC_1_CFG1_HIGH_LIMIT              (u)
    #define ADC_1_CFG1_RANGE_COND              (uL)
    #define ADC_1_CFG1_USE_SOC                 (0uL)
    /* Clock parameters*/
    #if (ADC_1_CLOCK_INTERNAL)
        #define ADC_1_CFG1_CLOCKDIVIDER        (((CYDEV_BCLK__HFCLK__HZ) / (ADC_1_CFG1_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_1_CLOCK_INTERNAL) */
    /* Filter Parameters */
    #if(ADC_1_CFG1_FILTER_PRESENT == 1uL)
    /* Timing settings */
        /* Clock divider register uses 0 for a divider of 1, 1 for a divider of 2, and so on. */
        #define ADC_1_CFG1_FILTERCLOCKDIVIDER  (u - 1u)
        #define ADC_1_CFG1_FILTERSTARTDELAY    (u)
    #endif /* (ADC_1_CFG1_FILTER_PRESENT == 1uL) */
#endif /* #if(ADC_1_TOTAL_CONFIGS > 1) */

/* ************************************************************************** */
/* End configuration 1 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 2 customizer defines                                         */
/* ************************************************************************** */

#if(ADC_1_TOTAL_CONFIGS > 2)
    #define ADC_1_CFG2_SAMPLE_RATE             ()
    #define ADC_1_CFG2_CHANNEL_BASE            (u)
    #define ADC_1_CFG2_CHANNEL_COUNT           (u)
    #define ADC_1_CFG2_VREF_SEL_MASK           (u)
    #define ADC_1_CFG2_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_1_CFG2_CHANNEL_EN              (u)
    /* Sample Control Register */
    #define ADC_1_CFG2_SUB_RESOLUTION          (u)
    #define ADC_1_CFG2_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_1_CFG2_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_1_CFG2_SAMPLES_AVERAGED        (uL)
    #define ADC_1_CFG2_RANGE_INTR_MASK         (u)
    #define ADC_1_CFG2_SATURATE_INTR_MASK      (u)
    #define ADC_1_CFG2_VNEG_INPUT_SEL          ()
    #define ADC_1_CFG2_SINGLE_PRESENT          ()
    #define ADC_1_CFG2_VREF_MV_VALUE           ()
    #define ADC_1_CFG2_APERTURE_TIME0          (uL)
    #define ADC_1_CFG2_APERTURE_TIME1          (uL)
    #define ADC_1_CFG2_APERTURE_TIME2          (uL)
    #define ADC_1_CFG2_APERTURE_TIME3          (uL)
    #define ADC_1_CFG2_FREERUNNING             (u)
    #define ADC_1_CFG2_AVGERAGING_MODE         (uL)
    #define ADC_1_CFG2_LOW_LIMIT               (u)
    #define ADC_1_CFG2_HIGH_LIMIT              (u)
    #define ADC_1_CFG2_RANGE_COND              (uL)
    #define ADC_1_CFG2_USE_SOC                 (0uL)
    /* Clock parameters*/
    #if (ADC_1_CLOCK_INTERNAL)
        #define ADC_1_CFG2_CLOCKDIVIDER        (((CYDEV_BCLK__HFCLK__HZ) / (ADC_1_CFG2_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_1_CLOCK_INTERNAL) */
    /* Filter Parameters */
    #if(ADC_1_CFG2_FILTER_PRESENT == 1uL)
    /* Timing settings */
        /* Clock divider register uses 0 for a divider of 1, 1 for a divider of 2, and so on. */
        #define ADC_1_CFG2_FILTERCLOCKDIVIDER  (u - 1u)
        #define ADC_1_CFG2_FILTERSTARTDELAY    (u)
    #endif /* (ADC_1_CFG2_FILTER_PRESENT == 1uL) */
#endif /* (ADC_1_TOTAL_CONFIGS > 2) */

/* ************************************************************************** */
/* End configuration 2 customizer defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 3 customizer defines                                         */
/* ************************************************************************** */

#if(ADC_1_TOTAL_CONFIGS > 3)
    #define ADC_1_CFG3_SAMPLE_RATE             ()
    #define ADC_1_CFG3_CHANNEL_BASE            (u)
    #define ADC_1_CFG3_CHANNEL_COUNT           (u)
    #define ADC_1_CFG3_VREF_SEL_MASK           (u)
    #define ADC_1_CFG3_NOMINAL_CLOCK_FREQ      (u)
    #define ADC_1_CFG3_CHANNEL_EN              (u)
    /* Sample Control Register */
    #define ADC_1_CFG3_SUB_RESOLUTION          (u)
    #define ADC_1_CFG3_SINGLE_ENDED_FORMAT     (uL)
    #define ADC_1_CFG3_DIFFERENTIAL_FORMAT     (uL)
    #define ADC_1_CFG3_SAMPLES_AVERAGED        (uL)
    #define ADC_1_CFG3_RANGE_INTR_MASK         (u)
    #define ADC_1_CFG3_SATURATE_INTR_MASK      (u)
    #define ADC_1_CFG3_VNEG_INPUT_SEL          ()
    #define ADC_1_CFG3_SINGLE_PRESENT          ()
    #define ADC_1_CFG3_VREF_MV_VALUE           ()
    #define ADC_1_CFG3_APERTURE_TIME0          (uL)
    #define ADC_1_CFG3_APERTURE_TIME1          (uL)
    #define ADC_1_CFG3_APERTURE_TIME2          (uL)
    #define ADC_1_CFG3_APERTURE_TIME3          (uL)
    #define ADC_1_CFG3_FREERUNNING             (u)
    #define ADC_1_CFG3_AVGERAGING_MODE         (uL)
    #define ADC_1_CFG3_LOW_LIMIT               (u)
    #define ADC_1_CFG3_HIGH_LIMIT              (u)
    #define ADC_1_CFG3_RANGE_COND              (uL)
    #define ADC_1_CFG3_USE_SOC                 (0uL)
    /* Clock parameters*/
    #if (ADC_1_CLOCK_INTERNAL)
        #define ADC_1_CFG3_CLOCKDIVIDER        (((CYDEV_BCLK__HFCLK__HZ) / (ADC_1_CFG3_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_1_CLOCK_INTERNAL) */
    /* Filter Parameters */
    #if(ADC_1_CFG3_FILTER_PRESENT == 1uL)
    /* Timing settings */
        /* Clock divider register uses 0 for a divider of 1, 1 for a divider of 2, and so on. */
        #define ADC_1_CFG3_FILTERCLOCKDIVIDER  (u - 1u)
        #define ADC_1_CFG3_FILTERSTARTDELAY    (u)
    #endif /* (ADC_1_CFG3_FILTER_PRESENT == 1uL) */
#endif /* (ADC_1_TOTAL_CONFIGS > 3) */

/* ************************************************************************** */
/* End configuration 3 customizer defines                                     */
/* ************************************************************************** */

#define ADC_1_DEFAULT_SAMPLE_MODE_SEL      (0u)
#define ADC_1_FREERUNNING                  (1u)
#define ADC_1_HARDWARESOC                  (1u)

/* Constants for setting the SAR to trigger the UAB Filter */
#define ADC_1_SRAM_CTRL_TRIGGER            (0x3F000000u)

