uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1.h
/** ADC_1_TOTAL_CHANNELS_NUM
* This constant represents the amount of input channels available for scanning.
*/
#define ADC_1_TOTAL_CHANNELS_NUM           (1u)

/*******************************************************************************
*    Variables with External Linkage
*******************************************************************************/
/**
* \addtogroup group_globals
* Globals are noted in the descriptions of the functions that use globals.
* They are marked with (R), (W), or (RW) noting whether the variable is read,
* write, or read/write.
* @{
*/

/** ADC_1_initVar
* The ADC_1_initVar variable is used to indicate
* initial configuration of this component. The variable is initialized to zero and
* set to 1 the first time ADC_1_Start() is called. This allows for
* component initialization without reinitialization in all subsequent calls to the
* ADC_1_Start() routine.
*
* If reinitialization of the component is required, then the ADC_1_Init() function
* can be called before the ADC_1_Start() or ADC_1_Enable()
* functions.
*/
extern uint8 ADC_1_initVar;
extern uint8 ADC_1_selected;

#define ADC_1_INIT_VAR_INIT_FLAG     (0x01u)

/** ADC_1_offset
* This array calibrates the offset for each channel. The first time Start() is
* called, the offset array's entries are initialized to 0, except for channels
* which are Single-Ended, Signed, and have Vneg=Vref, for which it is set to
* -2^(Resolution-1)/Vref(mV). It can be modified using ADC_SetOffset(). The array
* is used by the ADC_CountsTo_Volts(), ADC_CountsTo_mVolts(), and
* ADC_CountsTo_uVolts() functions.
*/
extern volatile int16 ADC_1_offset[ADC_1_TOTAL_CHANNELS_NUM];

/** ADC_1_countsPer10Volt
* This array is used to calibrate the gain for each channel. It is calculated
* the first time ADC_1_Start() is called. The value depends on
* channel resolution and voltage reference. It can be changed using
* ADC_1_SetGain().
*
* This array affects the ADC_1_CountsTo_Volts(),
* ADC_1_CountsTo_mVolts(), and ADC_1_CountsTo_uVolts()
* functions by supplying the correct conversion between ADC counts and the
* applied input voltage.
*/
extern volatile int32 ADC_1_countsPer10Volt[ADC_1_TOTAL_CHANNELS_NUM];   /* Gain compensation */
extern const ADC_1_CONFIG_STRUCT ADC_1_allConfigs[ADC_1_TOTAL_CONFIGS];
extern const uint32 CYCODE ADC_1_InputsPlacement[ADC_1_TOTAL_CHANNELS_NUM];

/** @} globals */

#define ADC_1_HALF_A_CC_GND              (0) /* Half A CC_GND is always zero */
#define ADC_1_SW_EXTAGND  (CyUAB_sw_id_enum) CyUAB_SW_ID(ADC_1_UABH_A_SW_STATIC_PTR,((uint32)ADC_1_UABH_A_halfuab__VAGND_SRC), CyUAB_SW_NOX)  /* static: OA+ <-> External routed agnd */
#define ADC_1_SW_EXTREFA  (CyUAB_sw_id_enum) CyUAB_SW_ID(ADC_1_UABH_A_SW_CA_IN0_PTR,((uint32)((uint32)ADC_1_UABH_A_halfuab__VREF_SRC)*ADC_1_UABH_A_DYNAMIC_FIELD_SIZE), CyUAB_SW_NOX) /* A in <-> External routed vref */
#define ADC_1_SW_EXTREFB  (CyUAB_sw_id_enum) CyUAB_SW_ID(ADC_1_UABH_A_SW_CB_IN0_PTR,((uint32)((uint32)ADC_1_UABH_A_halfuab__VREF_SRC)*ADC_1_UABH_A_DYNAMIC_FIELD_SIZE ), CyUAB_SW_NOX) /* B in <-> External routed vref */

#define ADC_1_MAX_FREQUENCY              (18000000u)       /*18Mhz*/

#define ADC_1_10US_DELAY                 (10u)
#define ADC_1_10V_COUNTS                 (10.0F)
#define ADC_1_10MV_COUNTS                (10000)
#define ADC_1_10UV_COUNTS                (10000000L)

/*******************************************************************************
*              Registers
*******************************************************************************/

#define ADC_1_SAR_CTRL_REG                   (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CTRL )
#define ADC_1_SAR_CTRL_PTR                   ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CTRL )

#define ADC_1_SAR_SAMPLE_CTRL_REG            (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_SAMPLE_CTRL )
#define ADC_1_SAR_SAMPLE_CTRL_PTR            ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_SAMPLE_CTRL )

#define ADC_1_SAR_SAMPLE_TIME01_REG          (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_SAMPLE_TIME01 )
#define ADC_1_SAR_SAMPLE_TIME01_PTR          ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_SAMPLE_TIME01 )

#define ADC_1_SAR_SAMPLE_TIME23_REG          (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_SAMPLE_TIME23 )
#define ADC_1_SAR_SAMPLE_TIME23_PTR          ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_SAMPLE_TIME23 )

#define ADC_1_SAR_RANGE_THRES_REG            (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_RANGE_THRES )
#define ADC_1_SAR_RANGE_THRES_PTR            ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_RANGE_THRES )

#define ADC_1_SAR_RANGE_COND_REG             (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_RANGE_COND )
#define ADC_1_SAR_RANGE_COND_PTR             ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_RANGE_COND )

#define ADC_1_SAR_CHAN_EN_REG                (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CHAN_EN )
#define ADC_1_SAR_CHAN_EN_PTR                ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CHAN_EN )

#define ADC_1_SAR_START_CTRL_REG             (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_START_CTRL )
#define ADC_1_SAR_START_CTRL_PTR             ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_START_CTRL )
/* CDT-230388: These constants are getting added to cyfitter.h */
#define ADC_1_SAR_DFT_CTRL_REG               (*(reg32 *) CYREG_SAR_DFT_CTRL )
#define ADC_1_SAR_DFT_CTRL_PTR               ( (reg32 *) CYREG_SAR_DFT_CTRL )

#define ADC_1_SAR_CHAN_CONFIG_REG            (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CHAN_CONFIG00 )
#define ADC_1_SAR_CHAN_CONFIG_PTR            ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CHAN_CONFIG00 )
#define ADC_1_SAR_CHAN_CONFIG_IND            ( ADC_1_cy_psoc4_sar_1__SAR_CHAN_CONFIG00 )

#define ADC_1_SAR_CHAN_WORK_REG              (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CHAN_WORK00 )
#define ADC_1_SAR_CHAN_WORK_PTR              ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CHAN_WORK00 )

#define ADC_1_SAR_CHAN_RESULT_REG            (*(reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CHAN_RESULT0 )
#define ADC_1_SAR_CHAN_RESULT_PTR            ( (reg32 *) ADC_1_cy_psoc4_sar_1__SAR_CHAN_RESULT0 )

#define ADC_1_SAR_CHAN_RESULT_IND            ( ADC_1_cy_psoc4_sar_1__SAR_CHAN_RESULT00 )

#define ADC_1_SAR_CHAN0_RESULT_REG           (*(reg32 *) ADC_1_cy_psoc4_sarmux_1__SAR_CHAN_RESULT00 )
#define ADC_1_SAR_CHAN0_RESULT_PTR           ( (reg32 *) ADC_1_cy_psoc4_sarmux_1__SAR_CHAN_RESULT00 )

#define ADC_1_SAR_CHAN1_RESULT_REG           (*(reg32 *) ADC_1_cy_psoc4_sarmux_1__SAR_CHAN_RESULT01 )
#define ADC_1_SAR_CHAN1_RESULT_PTR           ( (reg32 *) ADC_1_cy_psoc4_sarmux_1__SAR_CHAN_RESULT01 )

#define ADC_1_SAR_CHAN2_RESULT_REG           (*(reg32 *) ADC_1_cy_psoc4_sarmux_1__SAR_CHAN_RESULT2 )
#define ADC_1_SAR_CHAN2_RESULT_PTR           ( (reg32 *) ADC_1_cy_psoc4_sarmux_1__SAR_CHAN_RESULT2 )

#define ADC_1_SAR_CHAN3_RESULT_REG           (*(reg32 *) ADC_1_cy_psoc4_sarmux_1__SAR_CHAN_RESULT3 )
#define ADC_1_SAR_CHAN3_RESULT_PTR           ( (reg32 *) ADC_1_cy_psoc4_sarmux_1__SAR_CHAN_RESULT3 )

