uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1.h
/*******************************************************************************
*       Register Constants
*******************************************************************************/
#define ADC_1_VIN_SWITCH_CLOSED                        (0xFu)
#define ADC_1_VIN_ALL_SWITCHES_MASK                    (0xFFFFu)     /* Mask for SW_C**_IN0 VIN settings */

#define ADC_1_INTC_NUMBER                              (ADC_1_IRQ__INTC_NUMBER)
#define ADC_1_INTC_PRIOR_NUMBER                        (ADC_1_IRQ__INTC_PRIOR_NUM)

/* ***************************SAR_CTRL_REG fields *************************** */
/* VREF_SEL bitfield -- 3 bits wide -- RW access */
#define ADC_1_SAR_CTRL_VREF_SEL_MSK                    (0x00000070u)
#define ADC_1_SAR_CTRL_VREF_SEL_SHFT                   (4ul)
    /* VREF_SEL bitfield enumerated values */
    #define ADC_1_VREF_SEL_VREF0                       (0x0ul)
    #define ADC_1_VREF_SEL_VREF1                       (0x1ul)
    #define ADC_1_VREF_SEL_VREF2                       (0x2ul)
    #define ADC_1_VREF_SEL_VREF_AROUTE                 (0x3ul)
    #define ADC_1_VREF_SEL_VBGR                        (0x4ul)
    #define ADC_1_VREF_SEL_VREF_EXT                    (0x5ul)
    #define ADC_1_VREF_SEL_VDDA_DIV_2                  (0x6ul)
    #define ADC_1_VREF_SEL_VDDA                        (0x7ul)

#define ADC_1__SAR_CTRL_VREF_BYP_AND_SEL_MSK           (0x000000F0u)
#define ADC_1__INTERNAL1024                            (ADC_1_VREF_SEL_VBGR \
                                                                    << ADC_1_SAR_CTRL_VREF_SEL_SHFT)
/* VREF is zero for the component if routed by Creator to an internal reference */
#define ADC_1__INTERNALVREF                            (0x0ul)
#define ADC_1__VDDA_VREF                               (ADC_1_VREF_SEL_VDDA \
                                                                    << ADC_1_SAR_CTRL_VREF_SEL_SHFT)
#define ADC_1__EXT_VREF                               (ADC_1_VREF_SEL_VREF_EXT \
                                                                    << ADC_1_SAR_CTRL_VREF_SEL_SHFT)
/* VREF_BYP_CAP_EN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CTRL_VREF_BYP_CAP_EN_MSK             (0x00000080u)
#define ADC_1_SAR_CTRL_VREF_BYP_CAP_EN_SHFT            (7U)

/* NEG_SEL bitfield -- 3 bits wide -- RW access */
#define ADC_1_SAR_CTRL_NEG_SEL_MSK                     (0x00000e00ul)
#define ADC_1_SAR_CTRL_NEG_SEL_SHFT                    (9ul)
    /* NEG_SEL bitfield enumerated values */
    #define ADC_1_NEG_SEL_VSSA_KELVIN                  (0x0uL)
    #define ADC_1_NEG_SEL_ART_VSSA                     (0x1uL)
    #define ADC_1_NEG_SEL_P1                           (0x2uL)
    #define ADC_1_NEG_SEL_P3                           (0x3uL)
    #define ADC_1_NEG_SEL_P5                           (0x4uL)
    #define ADC_1_NEG_SEL_P7                           (0x5uL)
    #define ADC_1_NEG_SEL_ACORE                        (0x6uL)
    #define ADC_1_NEG_SEL_VREF                         (0x7uL)
    #define ADC_1_NEG_VREF_SHIFTED                     (ADC_1_NEG_SEL_VREF \
                                                                    << ADC_1_SAR_CTRL_NEG_SEL_SHFT)
/* SAR_HW_CTRL_NEGVREF bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CTRL_SAR_HW_CTRL_NEGVREF_MSK         (0x00002000u)
#define ADC_1_SAR_CTRL_SAR_HW_CTRL_NEGVREF_SHFT        (13U)

/* PWR_CTRL_VREF bitfield -- 2 bits wide -- RW access */
#define ADC_1_SAR_CTRL_PWR_CTRL_VREF_MSK               (0x0000c000u)
#define ADC_1_SAR_CTRL_PWR_CTRL_VREF_SHFT              (14u)
    /* PWR_CTRL_VREF bitfield enumerated values */
    #define ADC_1_PWR_CTRL_VREF_NORMAL_PWR             (0x0uL)
    #define ADC_1_PWR_CTRL_VREF_THIRD_PWR              (0x2uL)

/* SPARE bitfield -- 4 bits wide -- RW access */
#define ADC_1_SAR_CTRL_SPARE_MSK                       (0x000f0000u)
#define ADC_1_SAR_CTRL_SPARE_SHFT                      (16U)

/* BOOSTPUMP_EN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CTRL_BOOSTPUMP_EN_MSK                (0x00100000u)
#define ADC_1_SAR_CTRL_BOOSTPUMP_EN_SHFT               (20U)

/* REFBUF_EN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CTRL_REFBUF_EN_MSK                   (0x00200000u)
#define ADC_1_SAR_CTRL_REFBUF_EN_SHFT                  (21U)

/* ICONT_LV bitfield -- 2 bits wide -- RW access */
#define ADC_1_SAR_CTRL_ICONT_LV_MSK                    (0x03000000u)
#define ADC_1_SAR_CTRL_ICONT_LV_SHFT                   (24U)
    /* ICONT_LV bitfield enumerated values */
    #define ADC_1_ICONT_LV_NORMAL_PWR                  (0x0)
    #define ADC_1_ICONT_LV_HALF_PWR                    (0x1)
    #define ADC_1_ICONT_LV_MORE_PWR                    (0x2)
    #define ADC_1_ICONT_LV_QUARTER_PWR                 (0x3)

/* DEEPSLEEP_ON bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CTRL_DEEPSLEEP_ON_MSK                (0x08000000u)
#define ADC_1_SAR_CTRL_DEEPSLEEP_ON_SHFT               (27U)

/* DSI_SYNC_CONFIG bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CTRL_DSI_SYNC_CONFIG_MSK             (0x10000000u)
#define ADC_1_SAR_CTRL_DSI_SYNC_CONFIG_SHFT            (28U)

/* DSI_MODE bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CTRL_DSI_MODE_MSK                    (0x20000000u)
#define ADC_1_SAR_CTRL_DSI_MODE_SHFT                   (29U)

/* SWITCH_DISABLE bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CTRL_SWITCH_DISABLE_MSK              (0x40000000u)
#define ADC_1_SAR_CTRL_SWITCH_DISABLE_SHFT             (30U)

/* ENABLED bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CTRL_ENABLED_MSK                     (0x80000000u)
#define ADC_1_SAR_CTRL_ENABLED_SHFT                    (31U)


/* ***********************SAR_SAMPLE_CTRL_REG fields ************************ */
/* SUB_RESOLUTION bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_SUB_RESOLUTION_MSK       (0x00000001u)
#define ADC_1_SAR_SAMPLE_CTRL_SUB_RESOLUTION_SHFT      (0U)
    /* SUB_RESOLUTION bitfield enumerated values */
    #define ADC_1_SUB_RESOLUTION_8B                    (0x0U)
    #define ADC_1_SUB_RESOLUTION_10B                   (0x1U)

/* LEFT_ALIGN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_LEFT_ALIGN_MSK           (0x00000002u)
#define ADC_1_SAR_SAMPLE_CTRL_LEFT_ALIGN_SHFT          (1u)

/* SINGLE_ENDED_SIGNED bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_MSK  (0x00000004u)
#define ADC_1_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_SHFT (2u)
    /* SINGLE_ENDED_SIGNED bitfield enumerated values */
    #define ADC_1_SINGLE_ENDED_SIGNED_UNSIGNED         (0x0L)
    #define ADC_1_SINGLE_ENDED_SIGNED_SIGNED           (0x1L)

