uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1.h
/* DIFFERENTIAL_SIGNED bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_MSK  (0x00000008u)
#define ADC_1_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_SHFT (3u)
    /* DIFFERENTIAL_SIGNED bitfield enumerated values */
    #define ADC_1_DIFFERENTIAL_SIGNED_UNSIGNED         (0x0u)
    #define ADC_1_DIFFERENTIAL_SIGNED_SIGNED           (0x1u)

/* AVG_CNT bitfield -- 3 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_AVG_CNT_MSK              (0x00000070u)
#define ADC_1_SAR_SAMPLE_CTRL_AVG_CNT_SHFT             (4u)

/* AVG_SHIFT bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_AVG_SHIFT_MSK            (0x00000080u)
#define ADC_1_SAR_SAMPLE_CTRL_AVG_SHIFT_SHFT           (7u)

/* AVG_MODE bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_AVG_MODE_MSK             (0x00000100u)
#define ADC_1_SAR_SAMPLE_CTRL_AVG_MODE_SHFT            (8u)
    /* AVG_MODE bitfield enumerated values */
    #define ADC_1_AVG_MODE_ACCUNDUMP                   (0x0u)
    #define ADC_1_AVG_MODE_INTERLEAVED                 (0x1u)

/* CONTINUOUS bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_CONTINUOUS_MSK           (0x00010000u)
#define ADC_1_SAR_SAMPLE_CTRL_CONTINUOUS_SHFT          (16u)

/* DSI_TRIGGER_EN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_MSK       (0x00020000u)
#define ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_SHFT      (17u)

/* DSI_TRIGGER_LEVEL bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK    (0x00040000u)
#define ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_SHFT   (18u)

/* DSI_SYNC_TRIGGER bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_DSI_SYNC_TRIGGER_MSK     (0x00080000u)
#define ADC_1_SAR_SAMPLE_CTRL_DSI_SYNC_TRIGGER_SHFT    (19u)

/* UAB_SCAN_MODE bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_UAB_SCAN_MODE_MSK        (0x00400000u)
#define ADC_1_SAR_SAMPLE_CTRL_UAB_SCAN_MODE_SHFT       (22u)
    /* UAB_SCAN_MODE bitfield enumerated values */
    #define ADC_1_UAB_SCAN_MODE_UNSCHEDULED            (0x0u)
    #define ADC_1_UAB_SCAN_MODE_SCHEDULED              (0x1u)

/* REPEAT_INVALID bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_REPEAT_INVALID_MSK       (0x00800000u)
#define ADC_1_SAR_SAMPLE_CTRL_REPEAT_INVALID_SHFT      (23u)

/* VALID_SEL bitfield -- 3 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_VALID_SEL_MSK            (0x07000000u)
#define ADC_1_SAR_SAMPLE_CTRL_VALID_SEL_SHFT           (24u)

/* VALID_SEL_EN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_VALID_SEL_EN_MSK         (0x08000000u)
#define ADC_1_SAR_SAMPLE_CTRL_VALID_SEL_EN_SHFT        (27u)

/* VALID_IGNORE bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_VALID_IGNORE_MSK         (0x10000000u)
#define ADC_1_SAR_SAMPLE_CTRL_VALID_IGNORE_SHFT        (28u)

/* TRIGGER_OUT_EN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_MSK       (0x40000000u)
#define ADC_1_SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_SHFT      (30u)

/* EOS_DSI_OUT_EN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_MSK       (0x80000000u)
#define ADC_1_SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_SHFT      (31u)


/* **********************SAR_SAMPLE_TIME01_REG fields *********************** */
/* SAMPLE_TIME0 bitfield -- 10 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME0_MSK       (0x000003ffu)
#define ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME0_SHFT      (0u)

/* SAMPLE_TIME1 bitfield -- 10 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME1_MSK       (0x03ff0000u)
#define ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME1_SHFT      (16u)


/* **********************SAR_SAMPLE_TIME23_REG fields *********************** */
/* SAMPLE_TIME2 bitfield -- 10 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME2_MSK       (0x000003ffu)
#define ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME2_SHFT      (0u)

/* SAMPLE_TIME3 bitfield -- 10 bits wide -- RW access */
#define ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME3_MSK       (0x03ff0000u)
#define ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME3_SHFT      (16u)


/* ***********************SAR_RANGE_THRES_REG fields ************************ */
/* RANGE_LOW bitfield -- 16 bits wide -- RW access */
#define ADC_1_SAR_RANGE_THRES_RANGE_LOW_MSK            (0x0000ffffu)
#define ADC_1_SAR_RANGE_THRES_RANGE_LOW_SHFT           (0U)

/* RANGE_HIGH bitfield -- 16 bits wide -- RW access */
#define ADC_1_SAR_RANGE_THRES_RANGE_HIGH_MSK           (0xffff0000u)
#define ADC_1_SAR_RANGE_THRES_RANGE_HIGH_SHFT          (16U)


/* ************************SAR_RANGE_COND_REG fields ************************ */
/* RANGE_COND bitfield -- 2 bits wide -- RW access */
#define ADC_1_SAR_RANGE_COND_RANGE_COND_MSK            (0xc0000000u)
#define ADC_1_SAR_RANGE_COND_RANGE_COND_SHFT           (30u)
    /* RANGE_COND bitfield enumerated values */
    #define ADC_1_RANGE_COND_BELOW                     (0x0)
    #define ADC_1_RANGE_COND_INSIDE                    (0x1)
    #define ADC_1_RANGE_COND_ABOVE                     (0x2)
    #define ADC_1_RANGE_COND_OUTSIDE                   (0x3)


/* *************************SAR_CHAN_EN_REG fields ************************** */
/* CHAN_EN bitfield -- 16 bits wide -- RW access */
#define ADC_1_SAR_CHAN_EN_CHAN_EN_MSK                  (0x0000ffffu)
#define ADC_1_SAR_CHAN_EN_CHAN_EN_SHFT                 (0u)


/* ************************SAR_START_CTRL_REG fields ************************ */
/* FW_TRIGGER bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_START_CTRL_FW_TRIGGER_MSK            (0x00000001uL)
#define ADC_1_SAR_START_CTRL_FW_TRIGGER_SHFT           (0u)


/* *************************SAR_DFT_CTRL_REG fields ************************* */
/* DLY_INC bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_DFT_CTRL_DLY_INC_MSK                 (0x00000001uL)
#define ADC_1_SAR_DFT_CTRL_DLY_INC_SHFT                (0u)

/* HIZ bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_DFT_CTRL_HIZ_MSK                     (0x00000002uL)
#define ADC_1_SAR_DFT_CTRL_HIZ_SHFT                    (1u)

/* DFT_INC bitfield -- 4 bits wide -- RW access */
#define ADC_1_SAR_DFT_CTRL_DFT_INC_MSK                 (0x000f0000uL)
#define ADC_1_SAR_DFT_CTRL_DFT_INC_SHFT                (16u)

/* DFT_OUTC bitfield -- 3 bits wide -- RW access */
#define ADC_1_SAR_DFT_CTRL_DFT_OUTC_MSK                (0x00700000uL)
#define ADC_1_SAR_DFT_CTRL_DFT_OUTC_SHFT               (20u)

/* SEL_CSEL_DFT bitfield -- 4 bits wide -- RW access */
#define ADC_1_SAR_DFT_CTRL_SEL_CSEL_DFT_MSK            (0x0f000000uL)
#define ADC_1_SAR_DFT_CTRL_SEL_CSEL_DFT_SHFT           (24u)

