uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1.h
/* EN_CSEL_DFT bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_DFT_CTRL_EN_CSEL_DFT_MSK             (0x10000000uL)
#define ADC_1_SAR_DFT_CTRL_EN_CSEL_DFT_SHFT            (28u)

/* DCEN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_DFT_CTRL_DCEN_MSK                    (0x20000000uL)
#define ADC_1_SAR_DFT_CTRL_DCEN_SHFT                   (29u)

/* ADFT_OVERRIDE bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_DFT_CTRL_ADFT_OVERRIDE_MSK           (0x80000000uL)
#define ADC_1_SAR_DFT_CTRL_ADFT_OVERRIDE_SHFT          (31u)

/* ***********************SAR_CHAN_CONFIG_REG fields *********************** */
/* POS_PIN_ADDR bitfield -- 3 bits wide -- RW access */
#define ADC_1_SAR_CHAN_CONFIG_POS_PIN_ADDR_MSK         (0x00000007u)
#define ADC_1_SAR_CHAN_CONFIG_POS_PIN_ADDR_SHFT        (0u)

/* POS_PORT_ADDR bitfield -- 3 bits wide -- RW access */
#define ADC_1_SAR_CHAN_CONFIG_POS_PORT_ADDR_MSK        (0x00000070u)
#define ADC_1_SAR_CHAN_CONFIG_POS_PORT_ADDR_SHFT       (4u)
    /* POS_PORT_ADDR bitfield enumerated values */
    #define ADC_1_POS_PORT_ADDR_SARMUX                 (0x0)
    #define ADC_1_POS_PORT_ADDR_CTB0                   (0x1)
    #define ADC_1_POS_PORT_ADDR_CTB1                   (0x2)
    #define ADC_1_POS_PORT_ADDR_CTB2                   (0x3)
    #define ADC_1_POS_PORT_ADDR_CTB3                   (0x4)
    #define ADC_1_POS_PORT_ADDR_AROUTE_VIRT2           (0x5)
    #define ADC_1_POS_PORT_ADDR_AROUTE_VIRT1           (0x6)
    #define ADC_1_POS_PORT_ADDR_SARMUX_VIRT            (0x7)

/* DIFFERENTIAL_EN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CHAN_CONFIG_DIFFERENTIAL_EN_MSK      (0x00000100uL)
#define ADC_1_SAR_CHAN_CONFIG_DIFFERENTIAL_EN_SHFT     (8u)

/* RESOLUTION bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CHAN_CONFIG_RESOLUTION_MSK           (0x00000200u)
#define ADC_1_SAR_CHAN_CONFIG_RESOLUTION_SHFT          (9u)
    /* RESOLUTION bitfield enumerated values */
    #define ADC_1_RESOLUTION_MAXRES                    (0x0)
    #define ADC_1_RESOLUTION_SUBRES                    (0x1)

/* AVG_EN bitfield -- 1 bits wide -- RW access */
#define ADC_1_SAR_CHAN_CONFIG_AVG_EN_MSK               (0x00000400u)
#define ADC_1_SAR_CHAN_CONFIG_AVG_EN_SHFT              (10u)

/* SAMPLE_TIME_SEL bitfield -- 2 bits wide -- RW access */
#define ADC_1_SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_MSK      (0x00003000u)
#define ADC_1_SAR_CHAN_CONFIG_SAMPLE_TIME_SEL_SHFT     (12u)

/* NEG_PIN_ADDR bitfield -- 3 bits wide -- RW access */
#define ADC_1_SAR_CHAN_CONFIG_NEG_PIN_ADDR_MSK         (0x00070000u)
#define ADC_1_SAR_CHAN_CONFIG_NEG_PIN_ADDR_SHFT        (16u)

/* NEG_PORT_ADDR bitfield -- 3 bits wide -- RW access */
#define ADC_1_SAR_CHAN_CONFIG_NEG_PORT_ADDR_MSK        (0x00700000u)
#define ADC_1_SAR_CHAN_CONFIG_NEG_PORT_ADDR_SHFT       (20u)
/* NEG_PORT_ADDR bitfield enumerated values */
#define ADC_1_NEG_PORT_ADDR_SARMUX                     (0x0)
#define ADC_1_NEG_PORT_ADDR_CTB3                       (0x4)
/* NEG_ADDR_EN bitfield */
#define ADC_1_CHANNEL_CONFIG_NEG_ADDR_EN_MSK           (0x01000000u)
#define ADC_1_CHANNEL_CONFIG_NEG_ADDR_EN_SHFT          (24u)
/*Mask for everything that is set by ADC_1_channelsConfig[] */
#define ADC_1_CHANNEL_CONFIG_MASK                      (0x80003700u)
/* Channels are differential if DIFFERENTIAL _EN or NEG_ADDR_EN */
#define ADC_1_CHANNEL_CONFIG_DIFF_ALL_MSK              (ADC_1_SAR_CHAN_CONFIG_DIFFERENTIAL_EN_MSK \
                                                                  | ADC_1_CHANNEL_CONFIG_NEG_ADDR_EN_MSK)
/* ***********************SAR_CHAN_WORK_REG fields ************************* */
#define ADC_1_SAR_WRK_MAX_12BIT                        (0x00001000u)
#define ADC_1_SAR_WRK_MAX_10BIT                        (0x00000400u)
#define ADC_1_SAR_WRK_MAX_8BIT                         (0x00000100u)


/* ***********************SAR_CHAN_RESULT_REG fields ************************ */
#define ADC_1_RESULT_MASK                              (0x0000FFFFLu)
#define ADC_1_SATURATE_INTR_MIR                        (0x20000000Lu)
#define ADC_1_RANGE_INTR_MIR                           (0x40000000Lu)
#define ADC_1_CHAN_RESULT_VALID_MIR                    (0x80000000Lu)


/* ***********************SAR_INTR_MASK_REG fields ************************* */
#define ADC_1_EOS_MASK                                 (0x00000001u)
#define ADC_1_OVERFLOW_MASK                            (0x00000002u)
#define ADC_1_FW_COLLISION_MASK                        (0x00000004u)
#define ADC_1_DSI_COLLISION_MASK                       (0x00000008u)
#define ADC_1_INJ_EOC_MASK                             (0x00000010u)
#define ADC_1_INJ_SATURATE_MASK                        (0x00000020u)
#define ADC_1_INJ_RANGE_MASK                           (0x00000040u)
#define ADC_1_INJ_COLLISION_MASK                       (0x00000080u)

/* ************************  SAR_STATUS_REG fields ************************* */
#define ADC_1_CUR_CHAN_MSK                             (0x0000001Fu)
#define ADC_1_SW_VREF_NEG_MSK                          (0x40000000u)
#define ADC_1_SW_VREF_NEG_SHFT                         (30u)
#define ADC_1_BUSY_MSK                                 (0x80000000u)
#define ADC_1_BUSY_SHFT                                (31u)

/* ***********************SAR_MUX_SWITCH0_REG fields *********************** */
#define ADC_1_MUX_FW_VSSA_VMINUS                       (0x00010000Lu)


/* ***********************SAR_PUMP_CTRL_REG fields *********************** */
#define ADC_1_PUMP_CTRL_ENABLED                        (0x80000000Lu)

/* ************************************************************************** */
/* *******************Global MUX_SWITCH0 Definitions ************************ */
/* ************************************************************************** */
#if(ADC_1_CFG0_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN)
    /* Do not connect VSSA to VMINUS when one channel in differential mode used */
    #if((ADC_1_TOTAL_CHANNELS_NUM == 1u) && (ADC_1_CFG0_SINGLE_PRESENT == 0u))
        #define ADC_1_MUX_SWITCH0_INIT      0u
    #else    /* multiple channels or one single ended channel */
        #define ADC_1_MUX_SWITCH0_INIT      1u
    #endif /* ((ADC_1_TOTAL_CHANNELS_NUM == 1u) && (ADC_1_CFG0_SINGLE_PRESENT == 0u)) */
#else
    #define ADC_1_MUX_SWITCH0_INIT          0u
#endif /* ADC_1_CFG0_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN */

/* ************************************************************************** */
/* Begin configuration 0 calculated defines                                         */
/* ************************************************************************** */

#define ADC_1_CFG0_SAMPLE_TIME01_INIT \
        ((ADC_1_CFG0_APERTURE_TIME0 \
        << ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME0_SHFT) \
        | (ADC_1_CFG0_APERTURE_TIME1 \
        << ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME1_SHFT))

#define ADC_1_CFG0_SAMPLE_TIME23_INIT \
        ((ADC_1_CFG0_APERTURE_TIME2 \
        << ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME2_SHFT) \
        | (ADC_1_CFG0_APERTURE_TIME3 \
        << ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME3_SHFT))

/* Enable soc pin if used */
#define ADC_1_CFG0_DSI_TRIGGER_EN_INIT \
        (ADC_1_CFG0_USE_SOC \
        << ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_SHFT)

/* Set soc operation to edge or level based on sample mode */
#if(ADC_1_CFG0_FREERUNNING == ADC_1_FREERUNNING)
    #define ADC_1_CFG0_DSI_TRIGGER_LEVEL_INIT    (ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
#else /* Edge trigger */
    #define ADC_1_CFG0_DSI_TRIGGER_LEVEL_INIT    (0u)
#endif /* End ADC_1_CFG0_FREERUNNING == ADC_1_FREERUNNING */

/* Set SE_NEG_INPUT */
#if(ADC_1_CFG0_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN)
    #define ADC_1_CFG0_SE_NEG_INPUT_INIT \
            ((uint32)(ADC_1_NEG_SEL_VSSA_KELVIN \
            << ADC_1_SAR_CTRL_NEG_SEL_SHFT ))
#elif(ADC_1_CFG0_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VREF)
    /* Do not connect VNEG to VREF when one channel in differential mode used */
    /* Only needed for config 0 since 2+ configs == 2+ channels */
    #if((ADC_1_CFG0_CHANNEL_COUNT == 1u) && (ADC_1_CFG0_SINGLE_PRESENT == 0u))
        #define ADC_1_CFG0_SE_NEG_INPUT_INIT     0u
    #else    /* multiple channels or one single channel */
        #define ADC_1_CFG0_SE_NEG_INPUT_INIT     (ADC_1_NEG_SEL_VREF \
                                                            << ADC_1_SAR_CTRL_NEG_SEL_SHFT )
    #endif /* (ADC_1_CFG0_CHANNEL_COUNT == 1u) && (ADC_1_CFG0_CHANNELS_MODE != 0u) */
#elif (ADC_1_CFG0_SINGLE_PRESENT != 0u)
    #define ADC_1_CFG0_SE_NEG_INPUT_INIT         ADC_1_CFG0_NEG_OTHER
#else
    #define ADC_1_CFG0_SE_NEG_INPUT_INIT         0u
#endif /* ADC_1_CFG0_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN */

