uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1.h
#if(ADC_1_TOTAL_CHANNELS_NUM > 1u)
    #define ADC_1_CFG0_NEG_OTHER                 (uint16)((uint16)ADC_1_cy_psoc4_sarmux_1__VNEG0 << 9u)
    #define ADC_1_CFG0_SWITCH_CONF_INIT          0u
#else /* Disable SAR sequencer from enabling routing switches in single channel mode */
    #define ADC_1_CFG0_SWITCH_CONF_INIT          ADC_1_SAR_CTRL_SWITCH_DISABLE_MSK
    #define ADC_1_CFG0_NEG_OTHER                 0u
#endif /* ADC_1_CFG0_CHANNEL_COUNT > 1u */

/* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
#if(ADC_1_TOTAL_CHANNELS_NUM == 1u)
    #define ADC_1_CFG0_HW_CTRL_NEGVREF_INIT      0u
#else
    #define ADC_1_CFG0_HW_CTRL_NEGVREF_INIT      ADC_1_SAR_CTRL_SAR_HW_CTRL_NEGVREF_MSK
#endif /* ADC_1_CFG0_CHANNEL_COUNT == 1u */

#define ADC_1_CFG0_POWER_INIT  (ADC_1_PWR_CTRL_VREF_NORMAL_PWR)

/* SAMPLE_CTRL initial values */
#define ADC_1_CFG0_SE_RESULT_FORMAT_INIT \
        (ADC_1_CFG0_SINGLE_ENDED_FORMAT \
        << ADC_1_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_SHFT)

#define ADC_1_CFG0_DIFF_RESULT_FORMAT_INIT \
        (ADC_1_CFG0_DIFFERENTIAL_FORMAT \
        << ADC_1_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_SHFT)

#define ADC_1_CFG0_AVG_SAMPLES_NUM_INIT \
        (ADC_1_CFG0_SAMPLES_AVERAGED \
        << ADC_1_SAR_SAMPLE_CTRL_AVG_CNT_SHFT)

/* Combination of Average Mode and Average Shift */
#define ADC_1_CFG0_AVG_MODE_INIT \
        (ADC_1_CFG0_AVGERAGING_MODE \
        << ADC_1_SAR_SAMPLE_CTRL_AVG_SHIFT_SHFT)

/* If using a filter, set TRIGGER_OUT_EN  and SCAN_MODE to scheduled*/
#if(ADC_1_CFG0_FILTER_PRESENT == 1uL)
    #define ADC_1_CFG0_TRIGGER_OUT_INIT \
            (ADC_1_SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_MSK)
    #define ADC_1_CFG0_UAB_SCAN_MODE_INIT \
            (ADC_1_SAR_SAMPLE_CTRL_UAB_SCAN_MODE_MSK)
#else
    #define ADC_1_CFG0_TRIGGER_OUT_INIT      (0u)
    #define ADC_1_CFG0_UAB_SCAN_MODE_INIT    (0u)
#endif

#define ADC_1_CFG0_CTRL_INIT  \
        (ADC_1_CFG0_VREF_SEL_MASK \
        | ADC_1_CFG0_POWER_INIT \
        | ADC_1_SAR_CTRL_REFBUF_EN_MSK \
        | ADC_1_SAR_CTRL_DSI_SYNC_CONFIG_MSK  \
        | ADC_1_CFG0_SWITCH_CONF_INIT \
        | ADC_1_CFG0_SE_NEG_INPUT_INIT \
        | ADC_1_CFG0_HW_CTRL_NEGVREF_INIT )

#define ADC_1_CFG0_SAMPLE_CTRL_INIT \
        (ADC_1_CFG0_SUB_RESOLUTION \
        | ADC_1_CFG0_SE_RESULT_FORMAT_INIT \
        | ADC_1_CFG0_DIFF_RESULT_FORMAT_INIT \
        | ADC_1_CFG0_AVG_SAMPLES_NUM_INIT \
        | ADC_1_CFG0_AVG_MODE_INIT \
        | ADC_1_CFG0_DSI_TRIGGER_LEVEL_INIT \
        | ADC_1_CFG0_DSI_TRIGGER_EN_INIT \
        | ADC_1_CFG0_UAB_SCAN_MODE_INIT \
        | ADC_1_SAR_SAMPLE_CTRL_VALID_IGNORE_MSK \
        | ADC_1_CFG0_TRIGGER_OUT_INIT \
        | ADC_1_SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_MSK \
)

#define ADC_1_CFG0_RANGE_THRES_INIT \
        (ADC_1_CFG0_LOW_LIMIT \
        | (uint32)((uint32)ADC_1_CFG0_HIGH_LIMIT \
        << ADC_1_SAR_RANGE_THRES_RANGE_HIGH_SHFT))

#define ADC_1_CFG0_RANGE_COND_INIT \
        ((uint32)(ADC_1_CFG0_RANGE_COND \
        << ADC_1_SAR_RANGE_COND_RANGE_COND_SHFT))
/* Misc Config
    [0] - Freerunning: Set if the sample mode is freerunning
    [1] - Filter Present: Set if the configuration uses a UAB filter
*/
#define ADC_1_CFG0_MISC_CONFIG_INIT \
        (ADC_1_CFG0_FREERUNNING \
        | (ADC_1_CFG0_FILTER_PRESENT \
        << ADC_1_MISC_CONFIG_FILTER_PRESENT_SHFT))
/* ************************************************************************** */
/* End configuration 0 calculated defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 1 calculated defines                                         */
/* ************************************************************************** */

#if(ADC_1_TOTAL_CONFIGS > 1)
    #define ADC_1_CFG1_SAMPLE_TIME01_INIT \
            ((ADC_1_CFG1_APERTURE_TIME0 \
            << ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME0_SHFT) \
            | (ADC_1_CFG1_APERTURE_TIME1 \
            << ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME1_SHFT))

    #define ADC_1_CFG1_SAMPLE_TIME23_INIT \
            ((ADC_1_CFG1_APERTURE_TIME2 \
            << ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME2_SHFT) \
            | (ADC_1_CFG1_APERTURE_TIME3 \
            << ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME3_SHFT))

    /* Enable soc pin if used */
    #define ADC_1_CFG1_DSI_TRIGGER_EN_INIT \
            (ADC_1_CFG1_USE_SOC \
            << ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_SHFT)

    /* Set soc operation to edge or level based on sample mode */
    #if(ADC_1_CFG1_FREERUNNING == ADC_1_FREERUNNING)
        #define ADC_1_CFG1_DSI_TRIGGER_LEVEL_INIT    (ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
    #else /* Edge trigger */
        #define ADC_1_CFG1_DSI_TRIGGER_LEVEL_INIT    (0u)
    #endif /* End ADC_1_CFG1_FREERUNNING == ADC_1_FREERUNNING */

    /* Set SE_NEG_INPUT */
    #if(ADC_1_CFG1_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN)
        #define ADC_1_CFG1_SE_NEG_INPUT_INIT \
            ((uint32)(ADC_1_NEG_SEL_VSSA_KELVIN \
            << ADC_1_SAR_CTRL_NEG_SEL_SHFT ))
    #elif(ADC_1_CFG1_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VREF)
        #define ADC_1_CFG1_SE_NEG_INPUT_INIT     (ADC_1_NEG_SEL_VREF \
                                                            << ADC_1_SAR_CTRL_NEG_SEL_SHFT )
    #elif (ADC_1_CFG1_SINGLE_PRESENT != 0u)
        #define ADC_1_CFG1_SE_NEG_INPUT_INIT         ADC_1_CFG1_NEG_OTHER
    #else
        #define ADC_1_CFG1_SE_NEG_INPUT_INIT         0u
    #endif /* ADC_1_CFG1_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN */

    #define ADC_1_CFG1_NEG_OTHER                 (uint16)((uint16)ADC_1_cy_psoc4_sarmux_1__VNEG1 << 9u)
    #define ADC_1_CFG1_SWITCH_CONF_INIT          0u

    /* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
    #define ADC_1_CFG1_HW_CTRL_NEGVREF_INIT      ADC_1_SAR_CTRL_SAR_HW_CTRL_NEGVREF_MSK

    #define ADC_1_CFG1_POWER_INIT  (ADC_1_PWR_CTRL_VREF_NORMAL_PWR)

    /* SAMPLE_CTRL initial values */
    #define ADC_1_CFG1_SE_RESULT_FORMAT_INIT \
            (ADC_1_CFG1_SINGLE_ENDED_FORMAT \
            << ADC_1_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_SHFT)

    #define ADC_1_CFG1_DIFF_RESULT_FORMAT_INIT \
            (ADC_1_CFG1_DIFFERENTIAL_FORMAT \
            << ADC_1_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_SHFT)

    #define ADC_1_CFG1_AVG_SAMPLES_NUM_INIT \
            (ADC_1_CFG1_SAMPLES_AVERAGED \
            << ADC_1_SAR_SAMPLE_CTRL_AVG_CNT_SHFT)

    /* Combination of Average Mode and Average Shift */
    #define ADC_1_CFG1_AVG_MODE_INIT \
            (ADC_1_CFG1_AVGERAGING_MODE \
            << ADC_1_SAR_SAMPLE_CTRL_AVG_SHIFT_SHFT)

    /* If using a filter, set TRIGGER_OUT_EN  and SCAN_MODE to scheduled*/
    #if(ADC_1_CFG1_FILTER_PRESENT == 1uL)
        #define ADC_1_CFG1_TRIGGER_OUT_INIT \
                (ADC_1_SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_MSK)
        #define ADC_1_CFG1_UAB_SCAN_MODE_INIT \
                (ADC_1_SAR_SAMPLE_CTRL_UAB_SCAN_MODE_MSK)
    #else
        #define ADC_1_CFG1_TRIGGER_OUT_INIT      (0u)
        #define ADC_1_CFG1_UAB_SCAN_MODE_INIT    (0u)
    #endif

    #define ADC_1_CFG1_CTRL_INIT  \
            (ADC_1_CFG1_VREF_SEL_MASK \
            | ADC_1_CFG1_POWER_INIT \
            | ADC_1_SAR_CTRL_REFBUF_EN_MSK \
            | ADC_1_SAR_CTRL_DSI_SYNC_CONFIG_MSK  \
            | ADC_1_CFG1_SWITCH_CONF_INIT \
            | ADC_1_CFG1_SE_NEG_INPUT_INIT \
            | ADC_1_CFG1_HW_CTRL_NEGVREF_INIT )

    #define ADC_1_CFG1_SAMPLE_CTRL_INIT \
            (ADC_1_CFG1_SUB_RESOLUTION \
            | ADC_1_CFG1_SE_RESULT_FORMAT_INIT \
            | ADC_1_CFG1_DIFF_RESULT_FORMAT_INIT \
            | ADC_1_CFG1_AVG_SAMPLES_NUM_INIT \
            | ADC_1_CFG1_AVG_MODE_INIT \
            | ADC_1_CFG1_DSI_TRIGGER_LEVEL_INIT \
            | ADC_1_CFG1_DSI_TRIGGER_EN_INIT \
            | ADC_1_CFG1_UAB_SCAN_MODE_INIT \
            | ADC_1_SAR_SAMPLE_CTRL_VALID_IGNORE_MSK \
            | ADC_1_CFG1_TRIGGER_OUT_INIT \
            | ADC_1_SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_MSK \
    )

    #define ADC_1_CFG1_RANGE_THRES_INIT \
            (ADC_1_CFG1_LOW_LIMIT \
            | (uint32)((uint32)ADC_1_CFG1_HIGH_LIMIT \
            << ADC_1_SAR_RANGE_THRES_RANGE_HIGH_SHFT))

