uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1.h
    #define ADC_1_CFG1_RANGE_COND_INIT \
            ((uint32)(ADC_1_CFG1_RANGE_COND \
            << ADC_1_SAR_RANGE_COND_RANGE_COND_SHFT))
    /* Misc Config
        [0] - Freerunning: Set if the sample mode is freerunning
        [1] - Filter Present: Set if the configuration uses a UAB filter
    */
    #define ADC_1_CFG1_MISC_CONFIG_INIT \
            (ADC_1_CFG1_FREERUNNING \
            | (ADC_1_CFG1_FILTER_PRESENT \
            << ADC_1_MISC_CONFIG_FILTER_PRESENT_SHFT))
#endif /* ADC_1_TOTAL_CONFIGS > 1 */

/* ************************************************************************** */
/* End configuration 1 calculated defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 2 calculated defines                                         */
/* ************************************************************************** */

#if(ADC_1_TOTAL_CONFIGS > 2)
    #define ADC_1_CFG2_SAMPLE_TIME01_INIT \
            ((ADC_1_CFG2_APERTURE_TIME0 \
            << ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME0_SHFT) \
            | (ADC_1_CFG2_APERTURE_TIME1 \
            << ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME1_SHFT))

    #define ADC_1_CFG2_SAMPLE_TIME23_INIT \
            ((ADC_1_CFG2_APERTURE_TIME2 \
            << ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME2_SHFT) \
            | (ADC_1_CFG2_APERTURE_TIME3 \
            << ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME3_SHFT))

    /* Enable soc pin if used */
    #define ADC_1_CFG2_DSI_TRIGGER_EN_INIT \
            (ADC_1_CFG2_USE_SOC \
            << ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_SHFT)

    /* Set soc operation to edge or level based on sample mode */
    #if(ADC_1_CFG2_FREERUNNING == ADC_1_FREERUNNING)
        #define ADC_1_CFG2_DSI_TRIGGER_LEVEL_INIT    (ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
    #else /* Edge trigger */
        #define ADC_1_CFG2_DSI_TRIGGER_LEVEL_INIT    (0u)
    #endif /* End ADC_1_CFG2_FREERUNNING == ADC_1_FREERUNNING */

    /* Set SE_NEG_INPUT */
    #if(ADC_1_CFG2_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN)
        #define ADC_1_CFG2_SE_NEG_INPUT_INIT \
            ((uint32)(ADC_1_NEG_SEL_VSSA_KELVIN \
            << ADC_1_SAR_CTRL_NEG_SEL_SHFT ))
    #elif(ADC_1_CFG2_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VREF)
        #define ADC_1_CFG2_SE_NEG_INPUT_INIT     (ADC_1_NEG_SEL_VREF \
                                                                << ADC_1_SAR_CTRL_NEG_SEL_SHFT )
    #elif (ADC_1_CFG2_SINGLE_PRESENT != 0u)
        #define ADC_1_CFG2_SE_NEG_INPUT_INIT         ADC_1_CFG2_NEG_OTHER
    #else
        #define ADC_1_CFG2_SE_NEG_INPUT_INIT         0u
    #endif /* ADC_1_CFG2_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN */

   #define ADC_1_CFG2_NEG_OTHER                 (uint16)((uint16)ADC_1_cy_psoc4_sarmux_1__VNEG2 << 9u)
   
    #define ADC_1_CFG2_SWITCH_CONF_INIT          0u

    /* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
    #define ADC_1_CFG2_HW_CTRL_NEGVREF_INIT      ADC_1_SAR_CTRL_SAR_HW_CTRL_NEGVREF_MSK

    #define ADC_1_CFG2_POWER_INIT  (ADC_1_PWR_CTRL_VREF_NORMAL_PWR)

    /* SAMPLE_CTRL initial values */
    #define ADC_1_CFG2_SE_RESULT_FORMAT_INIT \
            (ADC_1_CFG2_SINGLE_ENDED_FORMAT \
            << ADC_1_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_SHFT)

    #define ADC_1_CFG2_DIFF_RESULT_FORMAT_INIT \
            (ADC_1_CFG2_DIFFERENTIAL_FORMAT \
            << ADC_1_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_SHFT)

    #define ADC_1_CFG2_AVG_SAMPLES_NUM_INIT \
            (ADC_1_CFG2_SAMPLES_AVERAGED \
            << ADC_1_SAR_SAMPLE_CTRL_AVG_CNT_SHFT)

    /* Combination of Average Mode and Average Shift */
    #define ADC_1_CFG2_AVG_MODE_INIT \
            (ADC_1_CFG2_AVGERAGING_MODE \
            << ADC_1_SAR_SAMPLE_CTRL_AVG_SHIFT_SHFT)

    /* If using a filter, set TRIGGER_OUT_EN  and SCAN_MODE to scheduled*/
    #if(ADC_1_CFG2_FILTER_PRESENT == 1uL)
        #define ADC_1_CFG2_TRIGGER_OUT_INIT \
                (ADC_1_SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_MSK)
        #define ADC_1_CFG2_UAB_SCAN_MODE_INIT \
                (ADC_1_SAR_SAMPLE_CTRL_UAB_SCAN_MODE_MSK)
    #else
        #define ADC_1_CFG2_TRIGGER_OUT_INIT      (0u)
        #define ADC_1_CFG2_UAB_SCAN_MODE_INIT    (0u)
    #endif

    #define ADC_1_CFG2_CTRL_INIT  \
            (ADC_1_CFG2_VREF_SEL_MASK \
            | ADC_1_CFG2_POWER_INIT \
            | ADC_1_SAR_CTRL_REFBUF_EN_MSK \
            | ADC_1_SAR_CTRL_DSI_SYNC_CONFIG_MSK  \
            | ADC_1_CFG2_SWITCH_CONF_INIT \
            | ADC_1_CFG2_SE_NEG_INPUT_INIT \
            | ADC_1_CFG2_HW_CTRL_NEGVREF_INIT )


    #define ADC_1_CFG2_SAMPLE_CTRL_INIT \
            (ADC_1_CFG2_SUB_RESOLUTION \
            | ADC_1_CFG2_SE_RESULT_FORMAT_INIT \
            | ADC_1_CFG2_DIFF_RESULT_FORMAT_INIT \
            | ADC_1_CFG2_AVG_SAMPLES_NUM_INIT \
            | ADC_1_CFG2_AVG_MODE_INIT \
            | ADC_1_CFG2_DSI_TRIGGER_LEVEL_INIT \
            | ADC_1_CFG2_DSI_TRIGGER_EN_INIT \
            | ADC_1_CFG2_UAB_SCAN_MODE_INIT \
            | ADC_1_SAR_SAMPLE_CTRL_VALID_IGNORE_MSK \
            | ADC_1_CFG2_TRIGGER_OUT_INIT \
            | ADC_1_SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_MSK \
    )

    #define ADC_1_CFG2_RANGE_THRES_INIT \
            (ADC_1_CFG2_LOW_LIMIT \
            | (uint32)((uint32)ADC_1_CFG2_HIGH_LIMIT \
            << ADC_1_SAR_RANGE_THRES_RANGE_HIGH_SHFT))

    #define ADC_1_CFG2_RANGE_COND_INIT \
            ((uint32)(ADC_1_CFG2_RANGE_COND \
            << ADC_1_SAR_RANGE_COND_RANGE_COND_SHFT))
    /* Misc Config
        [0] - Freerunning: Set if the sample mode is freerunning
        [1] - Filter Present: Set if the configuration uses a UAB filter
    */
    #define ADC_1_CFG2_MISC_CONFIG_INIT \
            (ADC_1_CFG2_FREERUNNING \
            | (ADC_1_CFG2_FILTER_PRESENT \
            << ADC_1_MISC_CONFIG_FILTER_PRESENT_SHFT))
#endif /* ADC_1_TOTAL_CONFIGS > 2 */

/* ************************************************************************** */
/* End configuration 2 calculated defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 3 calculated defines                                         */
/* ************************************************************************** */

#if(ADC_1_TOTAL_CONFIGS > 3)
    #define ADC_1_CFG3_SAMPLE_TIME01_INIT \
            ((ADC_1_CFG3_APERTURE_TIME0 \
            << ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME0_SHFT) \
            | (ADC_1_CFG3_APERTURE_TIME1 \
            << ADC_1_SAR_SAMPLE_TIME01_SAMPLE_TIME1_SHFT))

    #define ADC_1_CFG3_SAMPLE_TIME23_INIT \
            ((ADC_1_CFG3_APERTURE_TIME2 \
            << ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME2_SHFT) \
            | (ADC_1_CFG3_APERTURE_TIME3 \
            << ADC_1_SAR_SAMPLE_TIME23_SAMPLE_TIME3_SHFT))

    /* Enable soc pin if used */
    #define ADC_1_CFG3_DSI_TRIGGER_EN_INIT \
            (ADC_1_CFG3_USE_SOC \
             << ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_SHFT)

    /* Set soc operation to edge or level based on sample mode */
    #if(ADC_1_CFG3_FREERUNNING == ADC_1_FREERUNNING)
        #define ADC_1_CFG3_DSI_TRIGGER_LEVEL_INIT    (ADC_1_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
    #else /* Edge trigger */
        #define ADC_1_CFG3_DSI_TRIGGER_LEVEL_INIT    (0u)
    #endif /* End ADC_1_CFG3_FREERUNNING == ADC_1_FREERUNNING */

    /* Set SE_NEG_INPUT  */
    #if(ADC_1_CFG3_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN)
        #define ADC_1_CFG3_SE_NEG_INPUT_INIT \
            ((uint32)(ADC_1_NEG_SEL_VSSA_KELVIN \
            << ADC_1_SAR_CTRL_NEG_SEL_SHFT ))
    #elif(ADC_1_CFG3_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VREF)
        #define ADC_1_CFG3_SE_NEG_INPUT_INIT     (ADC_1_NEG_SEL_VREF \
                                                                << ADC_1_SAR_CTRL_NEG_SEL_SHFT )
    #elif (ADC_1_CFG3_SINGLE_PRESENT != 0u)
        #define ADC_1_CFG3_SE_NEG_INPUT_INIT         ADC_1_CFG3_NEG_OTHER
    #else
        #define ADC_1_CFG3_SE_NEG_INPUT_INIT         0u
    #endif /* ADC_1_CFG3_VNEG_INPUT_SEL == ADC_1_NEG_SEL_VSSA_KELVIN */

    #define ADC_1_CFG3_NEG_OTHER                 (uint16)((uint16)ADC_1_cy_psoc4_sarmux_1__VNEG3 << 9u)

    #define ADC_1_CFG3_SWITCH_CONF_INIT          0u

    /* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
    #define ADC_1_CFG3_HW_CTRL_NEGVREF_INIT      ADC_1_SAR_CTRL_SAR_HW_CTRL_NEGVREF_MSK

    #define ADC_1_CFG3_POWER_INIT  (ADC_1_PWR_CTRL_VREF_NORMAL_PWR)

    /* SAMPLE_CTRL initial values */
    #define ADC_1_CFG3_SE_RESULT_FORMAT_INIT \
            (ADC_1_CFG3_SINGLE_ENDED_FORMAT \
            << ADC_1_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_SHFT)

