uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/Generated_Source/PSoC4/ADC_1.h
    #define ADC_1_CFG3_DIFF_RESULT_FORMAT_INIT \
            (ADC_1_CFG3_DIFFERENTIAL_FORMAT \
            << ADC_1_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_SHFT)

    #define ADC_1_CFG3_AVG_SAMPLES_NUM_INIT \
            (ADC_1_CFG3_SAMPLES_AVERAGED \
            << ADC_1_SAR_SAMPLE_CTRL_AVG_CNT_SHFT)

    /* Combination of Average Mode and Average Shift */
    #define ADC_1_CFG3_AVG_MODE_INIT \
            (ADC_1_CFG3_AVGERAGING_MODE \
            << ADC_1_SAR_SAMPLE_CTRL_AVG_SHIFT_SHFT)

    /* If using a filter, set TRIGGER_OUT_EN  and SCAN_MODE to scheduled*/
    #if(ADC_1_CFG3_FILTER_PRESENT == 1uL)
        #define ADC_1_CFG3_TRIGGER_OUT_INIT \
                (ADC_1_SAR_SAMPLE_CTRL_TRIGGER_OUT_EN_MSK)
        #define ADC_1_CFG3_UAB_SCAN_MODE_INIT \
                (ADC_1_SAR_SAMPLE_CTRL_UAB_SCAN_MODE_MSK)
    #else
        #define ADC_1_CFG3_TRIGGER_OUT_INIT      (0u)
        #define ADC_1_CFG3_UAB_SCAN_MODE_INIT    (0u)
    #endif

    #define ADC_1_CFG3_CTRL_INIT  \
            (ADC_1_CFG3_VREF_SEL_MASK \
            | ADC_1_CFG3_POWER_INIT \
            | ADC_1_SAR_CTRL_REFBUF_EN_MSK \
            | ADC_1_SAR_CTRL_DSI_SYNC_CONFIG_MSK  \
            | ADC_1_CFG3_SWITCH_CONF_INIT \
            | ADC_1_CFG3_SE_NEG_INPUT_INIT \
            | ADC_1_CFG3_HW_CTRL_NEGVREF_INIT )


    #define ADC_1_CFG3_SAMPLE_CTRL_INIT \
            (ADC_1_CFG3_SUB_RESOLUTION \
            | ADC_1_CFG3_SE_RESULT_FORMAT_INIT \
            | ADC_1_CFG3_DIFF_RESULT_FORMAT_INIT \
            | ADC_1_CFG3_AVG_SAMPLES_NUM_INIT \
            | ADC_1_CFG3_AVG_MODE_INIT \
            | ADC_1_CFG3_DSI_TRIGGER_LEVEL_INIT \
            | ADC_1_CFG3_DSI_TRIGGER_EN_INIT \
            | ADC_1_CFG3_UAB_SCAN_MODE_INIT \
            | ADC_1_SAR_SAMPLE_CTRL_VALID_IGNORE_MSK \
            | ADC_1_CFG3_TRIGGER_OUT_INIT \
            | ADC_1_SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_MSK \
    )

    #define ADC_1_CFG3_RANGE_THRES_INIT \
            (ADC_1_CFG3_LOW_LIMIT \
            | (uint32)((uint32)ADC_1_CFG3_HIGH_LIMIT \
            << ADC_1_SAR_RANGE_THRES_RANGE_HIGH_SHFT))

    #define ADC_1_CFG3_RANGE_COND_INIT \
            ((uint32)(ADC_1_CFG3_RANGE_COND \
            << ADC_1_SAR_RANGE_COND_RANGE_COND_SHFT))
    /* Misc Config
        [0] - Freerunning: Set if the sample mode is freerunning
        [1] - Filter Present: Set if the configuration uses a UAB filter
    */
    #define ADC_1_CFG3_MISC_CONFIG_INIT \
            (ADC_1_CFG3_FREERUNNING \
            | (ADC_1_CFG3_FILTER_PRESENT \
            << ADC_1_MISC_CONFIG_FILTER_PRESENT_SHFT))

#endif /* ADC_1_TOTAL_CONFIGS > 3 */

/* ************************************************************************** */
/* End configuration 3 calculated defines                                     */
/* ************************************************************************** */


/*******************************************************************************
*       Configuration Structure Constants
*******************************************************************************/

/* Misc Config
    [0] - Freerunning: Set if the sample mode is freerunning
    [1] - Filter Present: Set if the configuration uses a UAB filter
    [2] - Mux Switch 0: Set when VSSA is used for the neg input to any single-ended channel
*/
#define ADC_1_MISC_CONFIG_FREERUNNING_MSK        0x01u
#define ADC_1_MISC_CONFIG_FILTER_PRESENT_MSK     0x02u
#define ADC_1_MISC_CONFIG_FILTER_PRESENT_SHFT    0x01u
#define ADC_1_MISC_CONFIG_MUX_SWITCH0_MSK        0x04u
#define ADC_1_MISC_CONFIG_MUX_SWITCH0_SHFT       0x02u

typedef enum
{
    LOW_PASS = 0, /**< Low pass */
    HIGH_PASS = 1, /**< High pass */
    BAND_PASS = 2, /**< Band pass */
    BAND_STOP = 3 /**< Notch */
} ADC_1_filter_type_enum;

/* Configuration description defines */
#define ADC_1_CFG0_TARGET_SPS 100000
#define ADC_1_CFG0_ACHIEVED_SPS 100000
#define ADC_1_CFG0_ADC_CLOCK_FREQ_HZ 12000000
#define ADC_1_CFG0_VREF_SOURCE VREFSOURCE_VDDA
#define ADC_1_CFG0_VREF_BYPASS True
#define ADC_1_CFG0_VNEG_SOURCE VNEGSOURCE_VREFSHORT
#define ADC_1_CFG0_NUM_SAMPLES_AVERAGED TWO_SAMPLES
#define ADC_1_CFG0_AVERAGING_MODE SEQUENTIAL_AVG
#define ADC_1_CFG0_ALT_RES EIGHT_BIT
#define ADC_1_CFG0_FILTER_TYPE LOW_PASS
#define ADC_1_CFG0_FILTER_F1_KHZ 10
#define ADC_1_CFG0_FILTER_F2_KHZ 50
#define ADC_1_CFG0_FILTER_SAMPLE_FREQ_KHZ 1500
#define ADC_1_CFG0_NUM_CHANNELS 1
#define ADC_1_CFG0_CHAN0_ENABLED True
#define ADC_1_CFG0_CHAN0_USE_ALT_RES False
#define ADC_1_CFG0_CHAN0_INPUT_MODE FILTER_CHAN
#define ADC_1_CFG0_CHAN0_USE_AVERAGING False
#define ADC_1_CFG0_CHAN0_MIN_ACQ_TIME_NS 194
#define ADC_1_CFG0_CHAN0_ACHIEVED_ACQ_TIME_NS 8792


#endif /* !defined(CY_ADC_1_H) */
/* [] END OF FILE */
